mapData = {
    id: `hotel0`,
    width: 12,
    height: 20,
    grid: `040404040404040404040404040505050505050505050504040707070707070707070704040808080808080808080804040808080808080808080804040808080808080808080804040808080808080808080804040808080808080808080804040808040404040404040404040808040505050405050504040808040707070407070704040808040808080408080804040808040808080408080804040808040808080408080804040808050808080508080804040808070808080708080804040808080808080808080804040808040808080408080804040808040404040404040404040408040404040404040404`,
    sprites: [[`move`, [2, 19], {
                size: [1, 1],
                direction: `down`,
                mapId: `test`,
                position: [3, 18]
            }], [`talk`, [9, 2], {
                image: [`images/sprites/goods.png`, 16, 0, 16, 48],
                size: [1, 3],
                event: async function* () {
                    yield "ふかふかのベッド"
                }
            }], [`talk`, [9, 10], {
                image: [`images/sprites/goods.png`, 32, 0, 16, 32],
                size: [1, 2],
                event: async function* () {
                    yield "トイレ;わりときれい"
                }
            }], [`talk`, [9, 10], {
                image: [`images/sprites/goods.png`, 32, 0, 16, 32],
                size: [1, 2],
                event: async function* () {
                    yield "トイレ;わりときれい"
                }
            }], [`talk`, [9, 2], {
                image: [`images/sprites/goods.png`, 16, 0, 16, 48],
                size: [1, 3],
                event: async function* () {
                    yield "ふかふかのベッド"
                }
            }]]
}